<?php

namespace App\Http\Controllers\Api;

use Illuminate\Http\Request;
use Illuminate\Routing\Controller;

class ApiTestController extends Controller
{
    // 获取接口文档
    public function test(Request $request) {
        $msglist = '{"Data":[{"phoneNum":"15695713342","times":"2023-05-19 16:29:01","msg":"【腾讯科技】你正在进行【QQ 21*******8登录验证】，验证码042786。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"15695713342","times":"2023-05-19 16:30:31","msg":"【腾讯科技】你正在进行【QQ 19******2登录验证】，验证码276055。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"15695713342","times":"2023-05-19 16:32:31","msg":"【腾讯科技】你正在进行【QQ 21*******8登录验证】，验证码042786。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"15695713342","times":"2023-05-19 16:34:00","msg":"【腾讯科技】你正在进行【QQ 21*******8登录验证】，验证码042786。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"13290436834","times":"2023-05-19 16:29:26","msg":"【腾讯科技】验证码：593199，用于QQ帐号身份验证，请勿泄露及转发。-QQ安全中心小程序"},{"phoneNum":"15658132141","times":"2023-05-19 16:29:12","msg":"【腾讯科技】你正在进行【QQ 27*******2登录验证】，验证码072643。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"15658132141","times":"2023-05-19 16:34:33","msg":"【腾讯科技】你正在进行【QQ 92******6登录验证】，验证码884697。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"15510484460","times":"2023-05-19 12:13:49","msg":"【腾讯科技】你正在进行【QQ 25*******5登录验证】，验证码584488。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"15510484460","times":"2023-05-19 15:14:00","msg":"【腾讯科技】你正在进行[QQ 32*******2登录验证]，验证码030495。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"15510484460","times":"2023-05-19 16:29:14","msg":"【腾讯科技】验证码：808504，用于QQ帐号身份验证，请勿泄露及转发。-QQ安全中心小程序"},{"phoneNum":"13049430510","times":"2023-05-19 16:28:14","msg":"【腾讯科技】你正在进行【QQ 20*******8登录验证】，验证码673234。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"},{"phoneNum":"13049430510","times":"2023-05-19 16:29:24","msg":"【腾讯科技】你正在<修改QQ20******48的密保手机>，验证码143452。提供给他人会导致QQ被盗，若非本人操作，请修改密码。"}]}';
        $msglist = json_decode($msglist,true);
        return response()->json([
            'code'   => 200,
            'status' => true,
            'msg'    => '',
            'ver'    => 'online123',
            'data'   => $msglist['Data'],
        ], JSON_UNESCAPED_UNICODE);
    }
}
