<?php
    $codelist = [];

    $base = [
        // 公共
        10000 => '服务器错误',
        10001 => '操作成功',
        10002 => '操作失败',
        10003 => '字段验证未通过',
        10004 => '字段不能为空',
        10005 => '系统繁忙,请稍后重试',
        10006 => '系统错误,请稍后重试',
        10007 => '该账户没有权限进行该操作',
        10008 => 'token不存在,或已过期,请重新登陆',
        10009 => '你还没有设置支付密码,请先设置支付密码',
        10010 => '支付密码不正确,请重新输入',
        10011 => '订单已经关闭',
        10012 => '备注不能为空',
        10013 => '未查询到数据',
        // 公共
        20000 => '参数错误',
        20001 => '无效的验证码或已过期',
        20002 => '验证码错误',
        20003 => '二维码生成失败',
        30001 => 'Token过期',
        30002 => 'Token无效',
        30003 => '用户不存在',
        30004 => '缺少Token',
        30005 => '无数据',
        40001 => '权限不足',
        40002 => '签名错误',
        40003 => '请求超时',

        50001 => '微信登陆失败',

    ];

    $base = $base + $codelist;

    return $base;